# Core Engineering
brew "git"
brew "gh"
brew "uv"
brew "direnv"
brew "difftastic"
brew "ripgrep"
brew "fzf"
brew "zoxide"
brew "tmux"
brew "neovim"
brew "volta"

# Applications (Casks)
cask "cursor"
cask "orbstack"
cask "visual-studio-code"
cask "raycast"
cask "obsidian"
cask "ollama-app"
cask "todoist-app"
cask "iterm2"
cask "cmux"
cask "keepingyouawake"

# Fonts
cask "font-jetbrains-mono-nerd-font"
